ymaps.ready(function() {
	lubanski = new ymaps.GeoObject({
		geometry: {
			type: 'Polygon',
			coordinates: [
							[
							[27.6966634,52.8874584],[27.6968503,52.8876179],[27.6970621,52.8877636],[27.6979572,52.8883116],[27.698727,52.8887869],[27.6988324,52.888843],[27.6989467,52.8888697],[27.7010528,52.8890893],[27.7033976,52.8893254],[27.7055631,52.8895563],[27.7050098,52.8905438],[27.704305,52.8917309],[27.7036011,52.8930274],[27.7028183,52.8943603],[27.7022251,52.8953967],[27.7013846,52.8967952],[27.7008068,52.8977793],[27.7005698,52.8981592],[27.7030457,52.899035],[27.7039415,52.8989508],[27.7097029,52.8998957],[27.7153462,52.9007564],[27.7200025,52.9013648],[27.7199631,52.895201],[27.7317855,52.8998705],[27.7309495,52.9045394],[27.7309281,52.9066942],[27.7342854,52.9082016],[27.7335373,52.9104082],[27.7376841,52.9129383],[27.7388387,52.9167136],[27.7383346,52.9176157],[27.7418797,52.9211945],[27.741272,52.9239366],[27.7411073,52.9247289],[27.7410133,52.9251574],[27.7409262,52.9255553],[27.7407402,52.9265359],[27.7404769,52.9276939],[27.7403918,52.9281772],[27.7394774,52.9313889],[27.7406635,52.9314795],[27.7426475,52.931683],[27.7445816,52.9318941],[27.7446607,52.9318865],[27.7447108,52.9318539],[27.7447388,52.9317959],[27.7511202,52.9323463],[27.7507361,52.932884],[27.7501365,52.9337473],[27.7500215,52.933912],[27.749978,52.9339926],[27.7499396,52.9341248],[27.7497761,52.9349738],[27.7497298,52.9352448],[27.7496353,52.9357969],[27.749627,52.9358464],[27.7495928,52.9359512],[27.7493213,52.936693],[27.7538678,52.9370864],[27.7590419,52.9375457],[27.761219,52.9377232],[27.7665549,52.9382059],[27.768358,52.9383786],[27.7684061,52.9382192],[27.7684546,52.938041],[27.7689161,52.9363136],[27.7689853,52.9360609],[27.7692214,52.9352],[27.7694425,52.9344423],[27.7696662,52.9336071],[27.770008,52.9323776],[27.7700425,52.9322504],[27.7701301,52.9319641],[27.7716154,52.9320997],[27.7742829,52.9323614],[27.7764674,52.9325869],[27.7792148,52.9328521],[27.7855628,52.9333661],[27.7861125,52.9336087],[27.7889267,52.9341556],[27.7891518,52.9342433],[27.7891835,52.9343825],[27.7883715,52.9364966],[27.7886462,52.936538],[27.7887843,52.936588],[27.7888637,52.9366462],[27.7889395,52.9367314],[27.7889913,52.9368542],[27.7890051,52.9369873],[27.7888119,52.9379527],[27.7886565,52.9388889],[27.7886186,52.9390595],[27.7884289,52.9402696],[27.7963072,52.9410507],[27.8074903,52.942106],[27.81625,52.9428966],[27.8173489,52.9432472],[27.8250246,52.9470448],[27.8292906,52.9493425],[27.8295816,52.94981],[27.8288706,52.9528087],[27.8286402,52.9529282],[27.8298725,52.9550381],[27.8278041,52.9555151],[27.8293438,52.9581356],[27.8273689,52.9585388],[27.8278364,52.9594381],[27.8273678,52.9606841],[27.8272385,52.9620858],[27.8269315,52.9666992],[27.8269476,52.9695021],[27.8277556,52.9707186],[27.82719,52.9714582],[27.8320863,52.9742023],[27.8370472,52.9771311],[27.8407868,52.9800044],[27.840354,52.9802549],[27.8468944,52.981916],[27.8561944,52.9840233],[27.8669152,52.9847834],[27.8755538,52.9854897],[27.8788224,52.9856854],[27.8883,52.9862638],[27.8903384,52.9813159],[27.9200064,52.976149],[27.9193721,52.9582864],[27.9186974,52.9544727],[27.943725,52.9541009],[27.949218,52.9431149],[27.960205,52.9431149],[27.9726085,52.9431149],[27.976684,52.9431149],[27.98767,52.9541009],[28.00415,52.9541009],[28.0045358,52.9638087],[28.015136,52.9650869],[28.015136,52.9211419],[28.031616,52.9101559],[28.031616,52.8991689],[28.0757812,52.895154],[28.0864025,52.8941885],[28.092041,52.8936759],[28.097534,52.8991689],[28.119506,52.8881829],[28.1683984,52.8881829],[28.174438,52.8881829],[28.201904,52.8936759],[28.207397,52.8936759],[28.223876,52.9046629],[28.22937,52.8936759],[28.256835,52.8936759],[28.267822,52.8607169],[28.2960367,52.862798],[28.3226676,52.8649015],[28.339233,52.8662099],[28.344726,52.8607169],[28.322753,52.8222649],[28.3185197,52.8135766],[28.3187824,52.8135548],[28.3189547,52.813533],[28.3199144,52.8134469],[28.3417799,52.8070395],[28.3414311,52.8066682],[28.3651542,52.8008803],[28.369825,52.8004433],[28.3702005,52.800333],[28.3759966,52.7997522],[28.3868731,52.7994573],[28.4027732,52.7987308],[28.4087585,52.7969257],[28.4116782,52.7960452],[28.4177796,52.7926484],[28.4240941,52.7907204],[28.4245099,52.7906085],[28.432617,52.7893059],[28.427124,52.7783199],[28.372192,52.7563469],[28.3668399,52.72791],[28.3665377,52.7263038],[28.416137,52.7178949],[28.4314814,52.7114535],[28.449096,52.7069089],[28.468236,52.691126],[28.4648586,52.6887377],[28.4720155,52.6845943],[28.4704009,52.683571],[28.4684897,52.6803205],[28.4674195,52.6790206],[28.4661637,52.6752499],[28.4530611,52.658982],[28.4384317,52.6596648],[28.445533,52.6530989],[28.4359388,52.6484561],[28.4348319,52.618514],[28.434791,52.6174087],[28.432617,52.5585929],[28.432617,52.5421139],[28.4106439,52.5256339],[28.4017651,52.5230842],[28.3831779,52.5201409],[28.3672469,52.5051175],[28.3447259,52.4871819],[28.2623289,52.481689],[28.2019039,52.476196],[28.1964109,52.492675],[28.1359859,52.487182],[28.1195059,52.525634],[28.0151359,52.509155],[27.9931639,52.514648],[27.9711909,52.509155],[27.9711909,52.503662],[27.968512,52.5024809],[27.9444856,52.5255542],[27.9263907,52.5293293],[27.8887929,52.5530999],[27.8702862,52.6039951],[27.8696821,52.6056563],[27.8668209,52.6135249],[27.8778069,52.6135249],[27.8778069,52.6354979],[27.8613279,52.6354979],[27.8610707,52.6473422],[27.8283689,52.6464839],[27.7899169,52.6629629],[27.7677508,52.7080079],[27.7585565,52.709275],[27.7404779,52.7124019],[27.7020259,52.7508539],[27.7130119,52.7563469],[27.7196207,52.7504123],[27.7425013,52.7690208],[27.7443085,52.8026346],[27.7522972,52.8075717],[27.7618157,52.8082775],[27.7691556,52.80895],[27.776044,52.8094177],[27.7740602,52.8150136],[27.7734369,52.8167719],[27.7734369,52.8222649],[27.7569579,52.8222649],[27.7514639,52.8442379],[27.7474289,52.8475127],[27.7231286,52.8673795],[27.7216196,52.8686306],[27.7139881,52.8748658],[27.7037924,52.8772147],[27.7036707,52.8774153],[27.7028645,52.8788693],[27.7019423,52.8805214],[27.7011311,52.8819868],[27.7003201,52.8834523],[27.6992387,52.8853751],[27.6986111,52.8865447],[27.6985211,52.8866923],[27.6984383,52.8867553],[27.6983447,52.8868203],[27.6982332,52.8868704],[27.6966634,52.8874584]
							]
						]
		},
		properties: {
			hintContent: 'Любанский район, Беларусь'
		}
	}, {
		fillColor: '#000033',
		fillOpacity: 0,
		strokeColor: '#CC0033',
		strokeOpacity: 1,
		strokeWidth: 3,
		strokeStyle: 'shortdash'
	});
	
	lubanski.events
		.add('mouseenter', function (e) {
			if (pick != 'lubanski') {
				lubanski.options.set({strokeColor: '#666633', fillOpacity: 0.2, strokeStyle: 'solid'});
			}
		})
		.add('mouseleave', function (e) {
			if (pick != 'lubanski') {
				EventsResetSchoolslubanski();
			}
		})
		.add('click', function (e) {
			ShowLubanski();
		});
		
		lubanskiPlacemark1 = new ymaps.Placemark([27.873564, 52.795484], 
		{
            hintContent: 'Государственное учреждение образования «Заболотская средняя школа Любанского района»',
            balloonContent: '<a href="http://zabolot.luban.edu.by/ru/main.aspx?guid=24241" target="_blank">Государственное учреждение образования «Заболотская средняя школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark2 = new ymaps.Placemark([28.357163, 52.668104], 
		{
            hintContent: 'Государственное учреждение образования «Загальская средняя школа Любанского района»',
            balloonContent: '<a href="http://zagalye.luban.edu.by/ru/main.aspx?guid=24191" target="_blank">Государственное учреждение образования «Загальская средняя школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark3 = new ymaps.Placemark([28.046239, 52.617460], 
		{
            hintContent: 'Государственное учреждение образования «Коммунаровская средняя школа имени Янки Купалы»',
            balloonContent: '<a href="https://kommuna.schools.by/m/pages/svobodnye-mesta-v-gruppah-dlja-detej-doshkolnogo-vozrasta" target="_blank">Государственное учреждение образования «Коммунаровская средняя школа имени Янки Купалы»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark4 = new ymaps.Placemark([28.063594, 52.570107], 
		{
            hintContent: 'Государственное учреждение образования «Кузьмичская средняя школа Любанского района»',
            balloonContent: '<a href="http://kuzmichi.luban.edu.by/ru/main.aspx?guid=24301" target="_blank">Государственное учреждение образования «Кузьмичская средняя школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark5 = new ymaps.Placemark([28.324088, 52.546143], 
		{
            hintContent: 'Государственное учреждение образования «Малогородятичская средняя школа Любанского района»',
            balloonContent: '<a href="http://mgorod.luban.edu.by/ru/main.aspx?guid=23711" target="_blank">Государственное учреждение образования «Малогородятичская средняя школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark6 = new ymaps.Placemark([27.912453, 52.756163], 
		{
            hintContent: 'Государственное учреждение образования «Обчинская базовая школа Любанского района»',
            balloonContent: '<a href="http://obchin.luban.edu.by/ru/main.aspx?guid=67541" target="_blank">Государственное учреждение образования «Обчинская базовая школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark7 = new ymaps.Placemark([28.184067, 52.856041], 
		{
            hintContent: 'Государственное учреждение образования «Осовецкая средняя школа Любанского района»',
            balloonContent: '<a href="http://osovec.luban.edu.by/ru/main.aspx?guid=23961" target="_blank">Государственное учреждение образования «Осовецкая средняя школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark8 = new ymaps.Placemark([28.250866, 52.591564], 
		{
            hintContent: 'Государственное учреждение образования «Паличинская средняя школа Любанского района»',
            balloonContent: '<a href="http://palichin.luban.edu.by/ru/main.aspx?guid=34011" target="_blank">Государственное учреждение образования «Паличинская средняя школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark9 = new ymaps.Placemark([28.250641, 52.668114],
		{
            hintContent: 'Государственное учреждение образования «Сосновская средняя школа № 2 Любанского района»',
            balloonContent: '<a href="http://sosny2.luban.edu.by/ru/main.aspx?guid=24011" target="_blank">Государственное учреждение образования «Сосновская средняя школа № 2 Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark10 = new ymaps.Placemark([27.989869, 52.663216], 
		{
            hintContent: 'Государственное учреждение образования «Староюрковичская средняя школа Любанского района»',
            balloonContent: '<a href="http://starurk.luban.edu.by/ru/main.aspx?guid=34031" target="_blank">Государственное учреждение образования «Староюрковичская средняя школа Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark11 = new ymaps.Placemark([27.954170, 52.855589], 
		{
            hintContent: 'Государственное учреждение образования «Тальская средняя школа имени И.А.Муравейко»',
            balloonContent: '<a href="http://talschool.by/index.php/odno-okno/doshkolnoe-vospitanie/roditelyam1/svobodnye-mesta" target="_blank">Государственное учреждение образования «Тальская средняя школа имени И.А.Муравейко»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark12 = new ymaps.Placemark([28.274249, 52.770364], 
		{
            hintContent: 'Государственное учреждение образования «Яминская средняя школа имени Героя Советского Союза З.Г.Лыщени»',
            balloonContent: '<a href="http://yaminsk.luban.edu.by/main.aspx?guid=23443" target="_blank">Государственное учреждение образования «Яминская средняя школа имени Героя Советского Союза З.Г.Лыщени»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark13 = new ymaps.Placemark([28.007063, 52.806645], 
		{
            hintContent: 'Государственное учреждение образования «Детский сад № 3 г. Любани»',
            balloonContent: '<a href="http://du3.luban.edu.by/ru/main.aspx?guid=23771" target="_blank">Государственное учреждение образования «Детский сад № 3 г. Любани»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark14 = new ymaps.Placemark([28.005805, 52.801751], 
		{
            hintContent: 'Государственное учреждение образования «Детский сад № 4 г. Любани»',
            balloonContent: '<a href="http://du4.luban.edu.by/ru/main.aspx?guid=23761" target="_blank">Государственное учреждение образования «Детский сад № 4 г. Любани»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark15 = new ymaps.Placemark([27.996184, 52.794003], 
		{
            hintContent: 'Государственное учреждение образования «Детский сад № 5 г. Любани»',
            balloonContent: '<a href="http://du5.luban.edu.by/ru/main.aspx?guid=23981" target="_blank">Государственное учреждение образования «Детский сад № 5 г. Любани»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark16 = new ymaps.Placemark([27.989294, 52.794226], 
		{
            hintContent: 'Государственное учреждение образования «Детский сад № 6 г. Любани»',
            balloonContent: '<a href="http://du6.luban.edu.by/ru/main.aspx?guid=34251" target="_blank">Государственное учреждение образования «Детский сад № 6 г. Любани»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark17 = new ymaps.Placemark([27.990570, 52.793028], 
		{
            hintContent: 'Государственное учреждение образования «Дошкольный центр развития ребенка «Сказка» г.Любани»',
            balloonContent: '<a href="http://skazka.luban.edu.by/ru/main.aspx?guid=23651" target="_blank">Государственное учреждение образования «Дошкольный центр развития ребенка «Сказка» г.Любани»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark18 = new ymaps.Placemark([27.875020, 52.949921], 
		{
            hintContent: 'Государственное учреждение образования «Уречский детский сад №10 Любанского района»',
            balloonContent: '<a href="http://du10.luban.edu.by/ru/main.aspx?guid=23821" target="_blank">Государственное учреждение образования «Уречский детский сад №10 Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark19 = new ymaps.Placemark([27.897054, 52.933360], 
		{
            hintContent: 'Государственное учреждение образования «Уречский детский сад № 35 Любанского района»',
            balloonContent: '<a href="http://du35.luban.edu.by/main.aspx?guid=33781" target="_blank">Государственное учреждение образования «Уречский детский сад № 35 Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark20 = new ymaps.Placemark([28.248638, 52.669938],
		{
            hintContent: 'Государственное учреждение образования «Сосновский детский сад Любанского района»',
            balloonContent: '<a href="http://du-sosny.luban.edu.by/ru/main.aspx?guid=24031" target="_blank">Государственное учреждение образования «Сосновский детский сад Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark21 = new ymaps.Placemark([28.017670, 52.787263],
		{
            hintContent: 'Государственное учреждение образования «Сорочский детский сад Любанского района»',
            balloonContent: '<a href="http://du-sorochi.luban.edu.by/ru/main.aspx?guid=24321" target="_blank">Государственное учреждение образования «Сорочский детский сад Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark22 = new ymaps.Placemark([27.783526, 52.716283], 
		{
            hintContent: 'Государственное учреждение образования «Отрадновский детский сад Любанского района»',
            balloonContent: '<a href="http://du-otrad.luban.edu.by/ru/main.aspx?guid=23671" target="_blank">Государственное учреждение образования «Отрадновский детский сад Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark23 = new ymaps.Placemark([27.785961, 52.893603], 
		{
            hintContent: 'Государственное учреждение образования «Доросинский детский сад Любанского района»',
            balloonContent: '<a href="http://dorosino.luban.edu.by/ru/main.aspx?guid=23741" target="_blank">Государственное учреждение образования «Доросинский детский сад Любанского района»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
		
		lubanskiPlacemark24 = new ymaps.Placemark([27.978326, 52.796148],
		{
            hintContent: 'Государственное учреждение образования «Детский сад № 1 г. Любани»',
            balloonContent: '<a href="" target="_blank">Государственное учреждение образования «Детский сад № 1 г. Любани»</a>'
        }, {
            // Опции.
            // Необходимо указать данный тип макета.
            iconLayout: 'default#image',
            // Своё изображение иконки метки.
            iconImageHref: 'logo.png',
            // Размеры метки.
            iconImageSize: [30, 30],
            // Смещение левого верхнего угла иконки относительно
            // её "ножки" (точки привязки).
            iconImageOffset: [-5, -38]
        });
});

function ShowLubanski(){
	if (pick != 'lubanski') {
		globalPlacemarkReset();
		globalResetInfo();
		pick = 'lubanski';
		lubanski.options.set({strokeColor: '#666633', fillOpacity: 0.2, strokeStyle: 'solid'});
		map.setCenter([28.101674, 52.720794], 10, { duration: 400	});
		setTimeout( () => {	
			lubanskiPlacemark1.options.set('visible', true);
			lubanskiPlacemark2.options.set('visible', true);
			lubanskiPlacemark3.options.set('visible', true);
			lubanskiPlacemark4.options.set('visible', true);
			lubanskiPlacemark5.options.set('visible', true);
			lubanskiPlacemark6.options.set('visible', true);
			lubanskiPlacemark7.options.set('visible', true);
			lubanskiPlacemark8.options.set('visible', true);
			lubanskiPlacemark9.options.set('visible', true);
			lubanskiPlacemark10.options.set('visible', true);
			lubanskiPlacemark11.options.set('visible', true);
			lubanskiPlacemark12.options.set('visible', true);
			lubanskiPlacemark13.options.set('visible', true);
			lubanskiPlacemark14.options.set('visible', true);
			lubanskiPlacemark15.options.set('visible', true);
			lubanskiPlacemark16.options.set('visible', true);
			lubanskiPlacemark17.options.set('visible', true);
			lubanskiPlacemark18.options.set('visible', true);
			lubanskiPlacemark19.options.set('visible', true);
			lubanskiPlacemark20.options.set('visible', true);
			lubanskiPlacemark21.options.set('visible', true);
			lubanskiPlacemark22.options.set('visible', true);
			lubanskiPlacemark23.options.set('visible', true);
			lubanskiPlacemark24.options.set('visible', true);
		}, 400);


		$("#info .lubanski").css("display", "block");
		$("#info").animate({right: '0'});
	}
}

function EventsResetSchoolslubanski() {
	lubanski.options.set({strokeColor: '#CC0033', fillOpacity: 0, strokeStyle: 'shortdash'});
	lubanskiPlacemark1.options.set('visible', false);
	lubanskiPlacemark2.options.set('visible', false);
	lubanskiPlacemark3.options.set('visible', false);
	lubanskiPlacemark4.options.set('visible', false);
	lubanskiPlacemark5.options.set('visible', false);
	lubanskiPlacemark6.options.set('visible', false);
	lubanskiPlacemark7.options.set('visible', false);
	lubanskiPlacemark8.options.set('visible', false);
	lubanskiPlacemark9.options.set('visible', false);
	lubanskiPlacemark10.options.set('visible', false);
	lubanskiPlacemark11.options.set('visible', false);
	lubanskiPlacemark12.options.set('visible', false);
	lubanskiPlacemark13.options.set('visible', false);
	lubanskiPlacemark14.options.set('visible', false);
	lubanskiPlacemark15.options.set('visible', false);
	lubanskiPlacemark16.options.set('visible', false);
	lubanskiPlacemark17.options.set('visible', false);
	lubanskiPlacemark18.options.set('visible', false);
	lubanskiPlacemark19.options.set('visible', false);
	lubanskiPlacemark20.options.set('visible', false);
	lubanskiPlacemark21.options.set('visible', false);
	lubanskiPlacemark22.options.set('visible', false);
	lubanskiPlacemark23.options.set('visible', false);
	lubanskiPlacemark24.options.set('visible', false);
}